#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h> 

#include <stdlib.h> // для перехода на русский язык 
int main(void) {


	char name1[9], name2[9], name3[9], sq2[12], sq3[13];
	unsigned short sc1;
	float sc3, sc2, cnt1, cnt2, cnt3;
	unsigned long int sq1;

	system("chcp 1251"); // переходим в консоли на русский язык 
	system("cls");       // очищаем окно консоли 


	/* Введение фактических данных*/
	printf("Введите: название, вид собствености, площадь земли, кол. работников: ");
	scanf("%s %hu %f %u", &name1, &sc1, &cnt1, &sq1);
	printf("Введите: название, вид собствености, площадь земли, кол. работников: ");
	scanf("%s %f %f %s", name2, &sc2, &cnt2, sq2);
	printf("Введите: название, вид собствености, площадь земли, кол. работников: ");
	scanf("%s %f %f %s", name3, &sc3, &cnt3, sq3);
	/* Вывод таблицы */

	/* вывод заголовков */
	printf("-------------------------------------------------------------------------------------\n");
	printf("| Приблизительное количество звезд разных спектральных классов в Галактике          |\n");
	printf("|-----------------------------------------------------------------------------------|\n");
	printf("| Спектральный класс | Приблизительная масса (отн.Солнца) |  Часть  |  Численность  |\n");
	printf("|--------------------|------------------------------------|---------|---------------|\n");

	/* вывод строк фактических данных */
	printf("| %18s | %34hu | %7.5f | %13u |\n", name1, sc1, cnt1, sq1);
	printf("| %18s | %34.2f | %7.1f | %13s |\n", name2, sc2, cnt2, sq2);
	printf("| %18s | %34.1f | %7.1f | %13s |\n", name3, sc3, cnt3, sq3);
	printf("-------------------------------------------------------------------------------------\n");
	printf("Трошин Матвей Максимович ИВТ-1\n");

	return 0;
}